type ResultType = {
  text: string;
  link: string;
  linkText: string;
  linkDescription: string;
  image: string;
};

export const resultsData: Record<string, ResultType> = {
  1: {
    text: "Ты — человек-комфорт, человек-уют. Ты всегда готов прийти на помощь близким, как бы тяжело тебе ни было. Но если кто-то посмеет надоедать тебе непрошенным советом или начнёт учить тебя жизни… Не завидуем этому бедолаге… Как говорится, не трожь домик-какашку, вонять не будет!",
    link: "https://aliexpress.ru/item/32977973717.html?sku_id=66814840781&spm=a2g2w.productlist.search_results.8.6f954aa6rNZmkX",
    linkText: "Забавная Лежанка для кошек",
    linkDescription: "",
    image: "png/testopolis/results/1.png",
  },
  2: {
    text: "Ты — икона стиля. Если бы Леди Гага и Дожа Кэт увидели, какой лук ты выбираешь, чтобы вынести мусор, они бы искусали все локти от зависти. Ты — звезда любого мероприятия, а твои друзья наверняка обращаются к тебе за модными советами. Иногда твоя смелость в образах вызывает вопросы, но мы-то знаем, что ты просто наперед чувствуешь, какой фасон кандибобера станет мастхэвом следующего сезона",
    link: "https://aliexpress.ru/item/4000680969930.html?sku_id=10000005971969163&spm=a2g2w.productlist.search_results.13.40cf4aa6ZZy01l",
    linkText: "Женские пляжные шлепанцы",
    linkDescription:
      ", ПВХ обувь с забавным принтом рыбы, сланцы, большие размеры",
    image: "png/testopolis/results/2.png",
  },
  3: {
    text: "Ты самодостаточный человек и не паришься о том, что подумают о тебе другие. В тебе невероятным образом сочетаются эрудиция, бунтарство и любовь к милым вещам. Ты всегда готов вступить в спор, чтобы объяснить свою точку зрения. Когда аргументов не остаётся, на помощь тебе приходит главный козырь: «И че?». И всё. Враги повержены, вы великолепны!",
    link: "https://aliexpress.ru/item/1005005685350019.html?srcSns=sns_Copy&businessType=ProductDetail&spreadType=socialShare&tt=MG&utm_medium=sharing&sku_id=12000034005789729",
    linkText: "Стильный рюкзак с гамбургерами",
    linkDescription: ", портативная Повседневная Сумка-тоут на молнии",
    image: "png/testopolis/results/3.png",
  },
  4: {
    text: "Ты — роскошь, граничащая с вульгарностью, но никогда не переступающая черту. Ты давно преисполнен в своем познании и уже не нуждаешься в фанфарах и пустых комплиментах. Ты видел всякое в жизни, но именно это сделало тебя тем, кто ты есть. Когда ты идёшь по улице, ты ловишь завистливые взгляды. Пусть смотрят — до тебя им ещё расти и расти",
    link: "https://aliexpress.ru/item/1005003691557532.html?sku_id=12000026820108673",
    linkText: "Королевский Золотой туалет в европейском стиле",
    linkDescription: "",
    image: "png/testopolis/results/4.png",
  },
  5: {
    text: "Ты способен сгладить любой конфликт точно так же, как эти ноготочки защищают нас от нападений любимых мохнатых. Ты делаешь это элегантно и изящно, в твоём арсенале можно найти сотни фраз и шуток, способных разрядить обстановку. Так держать! Таких коллег как ты — только ты!",
    link: "https://aliexpress.ru/item/1005001621654230.html?sku_id=12000016877580565&spm=a2g2w.productlist.search_results.2.14df4aa6ScqeG1",
    linkText: "Пластиковые колпачки для кошачьих коготков",
    linkDescription: "",
    image: "png/testopolis/results/5.png",
  },
  6: {
    text: "Ты – человек, который любит практичность и всегда обустраиваешь пространство вокруг себя так, чтобы тебе было в нем комфортно. Твое рабочее место организовано по одному тебе понятной схеме, но, что в целом неудивительно, ты прекрасно в ней ориентируешься. Ты тот коллега, к которому все приходят с вопросами, а уходят с грамотными решениями и восторгом от того, как ты гениален. Гордись собой и продолжай в том же духе.",
    link: "https://aliexpress.ru/item/32983871745.html?sku_id=12000028624763734&spm=a2g2w.productlist.search_results.0.54454f97iNOo6V",
    linkText: "Пряжка для ремня, держатель для пива",
    linkDescription: ", держатель для пива",
    image: "png/testopolis/results/6.png",
  },
  7: {
    text: "Твоим стальным нервам может позавидовать любой человек! В самой экстремальной ситуации ты сможешь найти оптимальное решение и получить максимум выгоды для себя. Однако, никто не представляет, чем ты занимаешь за закрытыми дверями своей квартиры. А там ты набираешь ароматную ванну, зажигаешь благовония и смотришь слезливую мелодраму, чтобы снять напряжение. Береги себя и помни, что твое ментальное здоровье превыше всего!",
    link: "https://aliexpress.ru/item/1005003396306784.html?sku_id=12000025591866796&spm=a2g2w.productlist.search_results.0.52ce387at3nmmQ",
    linkText: "Приколы для удаления прыщей",
    linkDescription: " Новинка прекратить сжимание акне",
    image: "png/testopolis/results/7.png",
  },
  8: {
    text: "Иногда ты пытаешься притворяться кем-то другим, но чаще всего выходит так себе... Помни, главное — быть честным перед самим собой! К тому же, все давно знают, что за чудесным намордником-крышкой для домашних животных скрывается замечательный мимимишный пёсель",
    link: "https://aliexpress.ru/item/1005001780457414.html?sku_id=12000017547469968&spm=a2g2w.productlist.search_results.0.f0774aa6qQEGdy",
    linkText: "Намордник для собак",
    linkDescription: " силиконовый «утиный клюв» остановить лай собак",
    image: "png/testopolis/results/8.png",
  },
  9: {
    text: "В тебе собраны самые прекрасные человеческие качества: дружелюбие, жизнерадостность, харизма, ну и, конечно, тяга к приключениям. Твои друзья никогда не знают, какую сторону характера смогут распробовать сегодня, но они уже не могут представить свою жизнь без тебя и каждый раз тянутся в твои согревающие объятия, чтобы почувствовать себя любимыми.",
    link: "https://aliexpress.ru/item/1005002311840272.html?sku_id=12000020026620127&spm=a2g2w.productlist.search_results.2.486d2139EKYM69",
    linkText: "Зимнее теплое одеяло «тортилья»",
    linkDescription: ", модное супермягкое плед «лаваш»",
    image: "png/testopolis/results/9.png",
  },
  10: {
    text: "Ты находчивый и неординарный, у тебя всегда всё под контролем. Ты готов к любой затее, ведь в твоей голове 1000 и 1 способ обмануть фейсконтроль. Бьёмся об заклад, у тебя в запасе куча историй, о которых немного стыдно рассказать, а ещё ты — настоящая душа компании и 100% весельчак!",
    link: "https://aliexpress.ru/item/1005006015648486.html?sku_id=12000035333456859&spm=a2g2w.productlist.search_results.0.6fda4aa6M6fvIs",
    linkText: "Портативная винная бутылкa",
    linkDescription:
      ", элегантная круглая фляжка из розового золота с браслетом",
    image: "png/testopolis/results/10.png",
  },
};
